# My First Pandas Walkthrough 
Date: 7/25/17
I am using following references:
* **[10 Minutes to pandas](https://pandas.pydata.org/pandas-docs/stable/10min.html):** This is a short introduction to pandas, geared mainly for new users. You can see more complex recipes in the Cookbook

Customarily, we import the following modules:

References:
* http://www.nyayapati.com/srao/2014/05/how-to-install-numpy-scipy-pandas-matplotlib-and-scikit-learn-on-mavericks/ 
* https://github.com/pydata/pandas-datareader

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Object Creation
Creating a **[Series](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.html#pandas.Series)** (See the [Data Structure Intro Section](https://pandas.pydata.org/pandas-docs/stable/dsintro.html#dsintro)) by passing a list of values, letting pandas create a default integer index:

**Aside:** Here, I also learned that Jupyter also allows Tab-completion and Tab-hints. For example, below I typed **pd.Ser+Tab** and it completed Series and on **np.n+Tab** it gave me a list of options to choose from which started with **np.nan**)

In [3]:
s = pd.Series([1,3,5,np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Creating [DataFrame](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html#pandas.DataFrame) by passing a numpy array, with a datetime index and labeled columns:

In [4]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.141693  0.316561  1.011421  0.919526
2013-01-02  1.729437  0.631199 -0.677232 -1.225070
2013-01-03 -0.188439  1.090964 -0.677291  1.248936
2013-01-04  0.242917  0.807838 -1.511049  0.522782
2013-01-05 -0.871605  1.290795  1.265340  0.568901
2013-01-06  2.469239  0.525681  1.875456 -0.330269

Creating a DataFrame by passing a dict of objects that can be converted to series-like.

In [6]:
df2 = pd.DataFrame({ 'A' : 1.,
...:                 'B' : pd.Timestamp('20130102'),
...:                  'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
...:               'D' : np.array([3] * 4,dtype='int32'),
                     'E' : pd.Categorical(["test","train","test","train"]),
                     'F' : 'foo' })

**Aside:** I learned here that a line continuation can be indicated by white space, three-dots or three-dots+anything else. But, two dots or less would give syntax error.

In [7]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Having specific [dtypes](https://pandas.pydata.org/pandas-docs/stable/basics.html#basics-dtypes)

In [8]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

If you’re using IPython, tab completion for column names (as well as public attributes) is automatically enabled. Here’s a subset of the attributes that will be completed:

df2.`<TAB>`

```
df2.A                  df2.bool
df2.abs                df2.boxplot
df2.add                df2.C
df2.add_prefix         df2.clip
df2.add_suffix         df2.clip_lower
df2.align              df2.clip_upper
df2.all                df2.columns
df2.any                df2.combine
df2.append             df2.combine_first
df2.apply              df2.compound
df2.applymap           df2.consolidate
df2.as_blocks          df2.convert_objects
df2.asfreq             df2.copy
df2.as_matrix          df2.corr
df2.astype             df2.corrwith
df2.at                 df2.count
df2.at_time            df2.cov
df2.axes               df2.cummax
df2.B                  df2.cummin
df2.between_time       df2.cumprod
df2.bfill              df2.cumsum
df2.blocks             df2.D
```

As you can see, the columns A, B, C, and D are automatically tab completed. E is there as well; the rest of the attributes have been truncated for brevity.

## Viewing Data
See the [Basics section](https://pandas.pydata.org/pandas-docs/stable/basics.html#basics)

See the top & bottom rows of the frame

In [9]:
df.head()

                   A         B         C         D
2013-01-01 -0.141693  0.316561  1.011421  0.919526
2013-01-02  1.729437  0.631199 -0.677232 -1.225070
2013-01-03 -0.188439  1.090964 -0.677291  1.248936
2013-01-04  0.242917  0.807838 -1.511049  0.522782
2013-01-05 -0.871605  1.290795  1.265340  0.568901

In [10]:
df.tail()

                   A         B         C         D
2013-01-02  1.729437  0.631199 -0.677232 -1.225070
2013-01-03 -0.188439  1.090964 -0.677291  1.248936
2013-01-04  0.242917  0.807838 -1.511049  0.522782
2013-01-05 -0.871605  1.290795  1.265340  0.568901
2013-01-06  2.469239  0.525681  1.875456 -0.330269

Display the index, columns, and the underlying numpy data

In [11]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df.columns

Index([u'A', u'B', u'C', u'D'], dtype='object')

In [13]:
df.values

array([[-0.14169316,  0.31656129,  1.01142059,  0.91952554],
       [ 1.72943679,  0.6311994 , -0.67723152, -1.22506968],
       [-0.18843935,  1.09096371, -0.67729092,  1.24893569],
       [ 0.24291697,  0.8078383 , -1.51104862,  0.5227823 ],
       [-0.87160548,  1.29079544,  1.26533997,  0.56890094],
       [ 2.46923936,  0.52568077,  1.87545552, -0.33026864]])

Describe shows a quick statistic summary of your data

In [14]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.539976  0.777173  0.214441  0.284134
std    1.281635  0.363300  1.346560  0.908603
min   -0.871605  0.316561 -1.511049 -1.225070
25%   -0.176753  0.552060 -0.677276 -0.117006
50%    0.050612  0.719519  0.167095  0.545842
75%    1.357807  1.020182  1.201860  0.831869
max    2.469239  1.290795  1.875456  1.248936

Transposing your data

In [15]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.141693    1.729437   -0.188439    0.242917   -0.871605    2.469239
B    0.316561    0.631199    1.090964    0.807838    1.290795    0.525681
C    1.011421   -0.677232   -0.677291   -1.511049    1.265340    1.875456
D    0.919526   -1.225070    1.248936    0.522782    0.568901   -0.330269

Sorting by an axis

In [16]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.919526  1.011421  0.316561 -0.141693
2013-01-02 -1.225070 -0.677232  0.631199  1.729437
2013-01-03  1.248936 -0.677291  1.090964 -0.188439
2013-01-04  0.522782 -1.511049  0.807838  0.242917
2013-01-05  0.568901  1.265340  1.290795 -0.871605
2013-01-06 -0.330269  1.875456  0.525681  2.469239

Sorting by values

In [17]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-01 -0.141693  0.316561  1.011421  0.919526
2013-01-06  2.469239  0.525681  1.875456 -0.330269
2013-01-02  1.729437  0.631199 -0.677232 -1.225070
2013-01-04  0.242917  0.807838 -1.511049  0.522782
2013-01-03 -0.188439  1.090964 -0.677291  1.248936
2013-01-05 -0.871605  1.290795  1.265340  0.568901

## Selection

**Note:** While standard Python / Numpy expressions for selecting and setting are intuitive and come in handy for interactive work, for production code, we recommend the optimized pandas data access methods, .at, .iat, .loc, .iloc and .ix.

See the indexing documentation Indexing and Selecting Data and MultiIndex / Advanced Indexing

## Getting

Selecting a single column, which yields a Series, equivalent to df.A

In [18]:
df['A']

2013-01-01   -0.141693
2013-01-02    1.729437
2013-01-03   -0.188439
2013-01-04    0.242917
2013-01-05   -0.871605
2013-01-06    2.469239
Freq: D, Name: A, dtype: float64

Selecting via [], which slices the rows.

In [19]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.141693  0.316561  1.011421  0.919526
2013-01-02  1.729437  0.631199 -0.677232 -1.225070
2013-01-03 -0.188439  1.090964 -0.677291  1.248936

In [20]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  1.729437  0.631199 -0.677232 -1.225070
2013-01-03 -0.188439  1.090964 -0.677291  1.248936
2013-01-04  0.242917  0.807838 -1.511049  0.522782

### Selection by Label

See more in [Selection by Label](https://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-label)

For getting a cross section using a label

In [21]:
df.loc[dates[0]]

A   -0.141693
B    0.316561
C    1.011421
D    0.919526
Name: 2013-01-01 00:00:00, dtype: float64

Selecting on a multi-axis by label

In [22]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.141693  0.316561
2013-01-02  1.729437  0.631199
2013-01-03 -0.188439  1.090964
2013-01-04  0.242917  0.807838
2013-01-05 -0.871605  1.290795
2013-01-06  2.469239  0.525681

Showing label slicing, both endpoints are included

In [23]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  1.729437  0.631199
2013-01-03 -0.188439  1.090964
2013-01-04  0.242917  0.807838

Reduction in the dimensions of the returned object

In [24]:
df.loc['20130102',['A','B']]

A    1.729437
B    0.631199
Name: 2013-01-02 00:00:00, dtype: float64

For getting a scalar value

In [25]:
df.loc[dates[0],'A']

-0.14169315732437648

For getting fast access to a scalar (equiv to the prior method)

In [26]:
df.at[dates[0],'A']

-0.14169315732437648

### Selection by Position

See more in [Selection by Position](https://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-integer)

Select via the position of the passed integers

In [27]:
df.iloc[3]

A    0.242917
B    0.807838
C   -1.511049
D    0.522782
Name: 2013-01-04 00:00:00, dtype: float64

By integer slices, acting similar to numpy/python

In [28]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.242917  0.807838
2013-01-05 -0.871605  1.290795

By lists of integer position locations, similar to the numpy/python style

In [29]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  1.729437 -0.677232
2013-01-03 -0.188439 -0.677291
2013-01-05 -0.871605  1.265340

For slicing rows explicitly

In [30]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  1.729437  0.631199 -0.677232 -1.225070
2013-01-03 -0.188439  1.090964 -0.677291  1.248936

For slicing columns explicitly

In [31]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.316561  1.011421
2013-01-02  0.631199 -0.677232
2013-01-03  1.090964 -0.677291
2013-01-04  0.807838 -1.511049
2013-01-05  1.290795  1.265340
2013-01-06  0.525681  1.875456

For getting a value explicitly

In [32]:
df.iloc[1,1]

0.63119939600189978

For getting fast access to a scalar (equiv to the prior method)

In [33]:
df.iat[1,1]

0.63119939600189978

### Boolean Indexing

Using a single column’s values to select data.

In [34]:
df[df.A > 0]

                   A         B         C         D
2013-01-02  1.729437  0.631199 -0.677232 -1.225070
2013-01-04  0.242917  0.807838 -1.511049  0.522782
2013-01-06  2.469239  0.525681  1.875456 -0.330269

Selecting values from a DataFrame where a boolean condition is met.

In [35]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.316561  1.011421  0.919526
2013-01-02  1.729437  0.631199       NaN       NaN
2013-01-03       NaN  1.090964       NaN  1.248936
2013-01-04  0.242917  0.807838       NaN  0.522782
2013-01-05       NaN  1.290795  1.265340  0.568901
2013-01-06  2.469239  0.525681  1.875456       NaN

Using the [isin()](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.isin.html#pandas.Series.isin) method for filtering:

In [36]:
df2 = df.copy()

In [37]:
df2['E'] = ['one', 'one','two','three','four','three']

In [38]:
df2

                   A         B         C         D      E
2013-01-01 -0.141693  0.316561  1.011421  0.919526    one
2013-01-02  1.729437  0.631199 -0.677232 -1.225070    one
2013-01-03 -0.188439  1.090964 -0.677291  1.248936    two
2013-01-04  0.242917  0.807838 -1.511049  0.522782  three
2013-01-05 -0.871605  1.290795  1.265340  0.568901   four
2013-01-06  2.469239  0.525681  1.875456 -0.330269  three

### Setting

Setting a new column automatically aligns the data by the indexes

In [39]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

In [40]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

Setting values by label

In [41]:
df.at[dates[0],'A'] = 0

Setting values by position

In [42]:
df.iat[0,1] = 0

Setting by assigning with a numpy array

In [43]:
df.loc[:,'D'] = np.array([5] * len(df))

The result of the prior setting operations

In [44]:
df

                   A         B         C  D
2013-01-01  0.000000  0.000000  1.011421  5
2013-01-02  1.729437  0.631199 -0.677232  5
2013-01-03 -0.188439  1.090964 -0.677291  5
2013-01-04  0.242917  0.807838 -1.511049  5
2013-01-05 -0.871605  1.290795  1.265340  5
2013-01-06  2.469239  0.525681  1.875456  5

A where operation with setting.

In [45]:
df2 = df.copy()

In [46]:
df2[df2 > 0] = -df2

In [47]:
df2

                   A         B         C  D
2013-01-01  0.000000  0.000000 -1.011421 -5
2013-01-02 -1.729437 -0.631199 -0.677232 -5
2013-01-03 -0.188439 -1.090964 -0.677291 -5
2013-01-04 -0.242917 -0.807838 -1.511049 -5
2013-01-05 -0.871605 -1.290795 -1.265340 -5
2013-01-06 -2.469239 -0.525681 -1.875456 -5

### Missing Data

pandas primarily uses the value np.nan to represent missing data. It is by default not included in computations. See the [Missing Data section](https://pandas.pydata.org/pandas-docs/stable/missing_data.html#missing-data).

Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.

In [48]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [49]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [50]:
df1

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  1.011421  5  1.0
2013-01-02  1.729437  0.631199 -0.677232  5  1.0
2013-01-03 -0.188439  1.090964 -0.677291  5  NaN
2013-01-04  0.242917  0.807838 -1.511049  5  NaN

To drop any rows that have missing data.

In [51]:
df1.dropna(how='any')

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  1.011421  5  1.0
2013-01-02  1.729437  0.631199 -0.677232  5  1.0

Filling missing data

In [52]:
df1.fillna(value=5)

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  1.011421  5  1.0
2013-01-02  1.729437  0.631199 -0.677232  5  1.0
2013-01-03 -0.188439  1.090964 -0.677291  5  5.0
2013-01-04  0.242917  0.807838 -1.511049  5  5.0

To get the boolean mask where values are _nan_

In [53]:
pd.isnull(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

## Operations

See the [Basic section on Binary Ops](https://pandas.pydata.org/pandas-docs/stable/basics.html#basics-binop)

### Stats

Operations in general exclude missing data.

Performing a descriptive statistic

In [54]:
df.mean()

A    0.563591
B    0.724413
C    0.214441
D    5.000000
dtype: float64

Same operation on the other axis

In [55]:
df.mean(1)

2013-01-01    1.502855
2013-01-02    1.670851
2013-01-03    1.306308
2013-01-04    1.134927
2013-01-05    1.671132
2013-01-06    2.467594
Freq: D, dtype: float64

Operating with objects that have different dimensionality and need alignment. In addition, pandas automatically broadcasts along the specified dimension.

In [56]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

In [57]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [58]:
df.sub(s, axis='index')

                   A         B         C    D
2013-01-01       NaN       NaN       NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN
2013-01-03 -1.188439  0.090964 -1.677291  4.0
2013-01-04 -2.757083 -2.192162 -4.511049  2.0
2013-01-05 -5.871605 -3.709205 -3.734660  0.0
2013-01-06       NaN       NaN       NaN  NaN

### Apply

Applying functions to the data

In [59]:
df.apply(np.cumsum)

                   A         B         C   D
2013-01-01  0.000000  0.000000  1.011421   5
2013-01-02  1.729437  0.631199  0.334189  10
2013-01-03  1.540997  1.722163 -0.343102  15
2013-01-04  1.783914  2.530001 -1.854150  20
2013-01-05  0.912309  3.820797 -0.588810  25
2013-01-06  3.381548  4.346478  1.286645  30

In [60]:
df.apply(lambda x: x.max() - x.min())

A    3.340845
B    1.290795
C    3.386504
D    0.000000
dtype: float64

### Histogramming

See more at [Histogramming and Discretization](https://pandas.pydata.org/pandas-docs/stable/basics.html#basics-discretization)

In [61]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [62]:
s

0    0
1    4
2    5
3    3
4    5
5    4
6    3
7    0
8    5
9    4
dtype: int64

In [63]:
s.value_counts()

5    3
4    3
3    2
0    2
dtype: int64

### String Methods

Series is equipped with a set of string processing methods in the str attribute that make it easy to operate on each element of the array, as in the code snippet below. Note that pattern-matching in str generally uses [regular expressions](https://docs.python.org/2/library/re.html) by default (and in some cases always uses them). See more at [Vectorized String Methods](https://pandas.pydata.org/pandas-docs/stable/text.html#text-string-methods).

In [64]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [65]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

## Merge
### Concat
pandas provides various facilities for easily combining together Series, DataFrame, and Panel objects with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations.

See the [Merging section](https://pandas.pydata.org/pandas-docs/stable/merging.html#merging)

Concatenating pandas objects together with [concat()](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.concat.html#pandas.concat):

In [66]:
df = pd.DataFrame(np.random.randn(10, 4))

In [67]:
df

          0         1         2         3
0 -0.256426 -0.601825 -0.898360 -0.444584
1  0.947158 -1.615977 -0.671814  0.856138
2  0.036879 -0.194187 -1.313732 -0.660862
3  0.905323  0.730273 -0.848413  1.855435
4 -1.194743 -0.174880  0.356789 -1.093845
5 -0.027028 -0.462397  1.082820  0.966843
6  0.533204 -0.681934  0.579695  1.858110
7 -0.554487 -2.095172 -0.575770  1.039312
8 -0.892002  0.669183 -0.514123  1.044262
9  0.167296 -2.147881 -1.782509 -1.854925

In [68]:
pieces = [df[:3], df[3:7], df[7:]]

In [69]:
pd.concat(pieces)

          0         1         2         3
0 -0.256426 -0.601825 -0.898360 -0.444584
1  0.947158 -1.615977 -0.671814  0.856138
2  0.036879 -0.194187 -1.313732 -0.660862
3  0.905323  0.730273 -0.848413  1.855435
4 -1.194743 -0.174880  0.356789 -1.093845
5 -0.027028 -0.462397  1.082820  0.966843
6  0.533204 -0.681934  0.579695  1.858110
7 -0.554487 -2.095172 -0.575770  1.039312
8 -0.892002  0.669183 -0.514123  1.044262
9  0.167296 -2.147881 -1.782509 -1.854925

### Join

SQL style merges. See the [Database style joining](https://pandas.pydata.org/pandas-docs/stable/merging.html#merging-join).

In [70]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
left

   key  lval
0  foo     1
1  foo     2

In [71]:
right

   key  rval
0  foo     4
1  foo     5

In [72]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

### Append

Append rows to a dataframe. See the [Appending](https://pandas.pydata.org/pandas-docs/stable/merging.html#merging-concatenation)

In [73]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0  0.639861  2.123232  0.266517 -0.115037
1 -0.102557  0.968530 -0.352717  0.548683
2 -0.538020 -1.862672 -0.114195 -0.700948
3 -0.325628  1.045267  0.092695 -1.208676
4  0.287648  1.250386  0.186462 -2.187714
5 -1.298120  1.071449  0.391817 -0.284815
6  1.219740  0.895399  0.168231 -0.264147
7  0.590377  0.064104  1.463538  1.902971

In [74]:
s = df.iloc[3]
df.append(s, ignore_index=True)

          A         B         C         D
0  0.639861  2.123232  0.266517 -0.115037
1 -0.102557  0.968530 -0.352717  0.548683
2 -0.538020 -1.862672 -0.114195 -0.700948
3 -0.325628  1.045267  0.092695 -1.208676
4  0.287648  1.250386  0.186462 -2.187714
5 -1.298120  1.071449  0.391817 -0.284815
6  1.219740  0.895399  0.168231 -0.264147
7  0.590377  0.064104  1.463538  1.902971
8 -0.325628  1.045267  0.092695 -1.208676

## Grouping

By “group by” we are referring to a process involving one or more of the following steps

* Splitting the data into groups based on some criteria      
* Applying a function to each group independently
* Combining the results into a data structure

See the [Grouping section](https://pandas.pydata.org/pandas-docs/stable/groupby.html#groupby)

In [75]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
   ....:                           'foo', 'bar', 'foo', 'foo'],
   ....:                    'B' : ['one', 'one', 'two', 'three',
   ....:                           'two', 'two', 'one', 'three'],
   ....:                    'C' : np.random.randn(8),
   ....:                    'D' : np.random.randn(8)})
   ....:

In [76]:
df

     A      B         C         D
0  foo    one -0.118189 -0.593383
1  bar    one  0.371635 -1.220654
2  foo    two -0.997569  0.600788
3  bar  three  0.719806  1.379115
4  foo    two -0.423254 -0.749692
5  bar    two  1.025332  0.834420
6  foo    one  0.639163  0.588942
7  foo  three -1.111726 -0.645374

Grouping and then applying a function sum to the resulting groups.

In [77]:
df.groupby('A').sum()

            C         D
A
bar  2.116773  0.992881
foo -2.011575 -0.798719

Grouping by multiple columns forms a hierarchical index, which we then apply the function.

In [78]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    0.371635 -1.220654
    three  0.719806  1.379115
    two    1.025332  0.834420
foo one    0.520974 -0.004441
    three -1.111726 -0.645374
    two   -1.420823 -0.148904

## Reshaping

See the sections on [Hierarchical Indexing](https://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced-hierarchical) and [Reshaping](https://pandas.pydata.org/pandas-docs/stable/reshaping.html#reshaping-stacking).

In [79]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
   ....:                      'foo', 'foo', 'qux', 'qux'],
   ....:                     ['one', 'two', 'one', 'two',
   ....:                      'one', 'two', 'one', 'two']]))
   ....:

In [80]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df2 = df[:4]
df2

                     A         B
first second
bar   one    -1.348059  0.706639
      two    -0.535673 -1.249346
baz   one     0.149370 -1.960042
      two    -1.884687 -0.878011

The [stack()](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.stack.html#pandas.DataFrame.stack) method “compresses” a level in the DataFrame’s columns.

In [81]:
stacked = df2.stack()
stacked

first  second
bar    one     A   -1.348059
               B    0.706639
       two     A   -0.535673
               B   -1.249346
baz    one     A    0.149370
               B   -1.960042
       two     A   -1.884687
               B   -0.878011
dtype: float64

With a “stacked” DataFrame or Series (having a MultiIndex as the index), the inverse operation of [stack()](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.stack.html#pandas.DataFrame.stack) is [unstack()](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.unstack.html#pandas.DataFrame.unstack), which by default unstacks the **last level**:

In [82]:
stacked.unstack()

                     A         B
first second
bar   one    -1.348059  0.706639
      two    -0.535673 -1.249346
baz   one     0.149370 -1.960042
      two    -1.884687 -0.878011

In [84]:
stacked.unstack(1)

second        one       two
first
bar   A -1.348059 -0.535673
      B  0.706639 -1.249346
baz   A  0.149370 -1.884687
      B -1.960042 -0.878011

In [85]:
stacked.unstack(0)

first          bar       baz
second
one    A -1.348059  0.149370
       B  0.706639 -1.960042
two    A -0.535673 -1.884687
       B -1.249346 -0.878011

## Pivot Tables

See the section on [Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html#reshaping-pivot).

In [86]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
   .....:                    'B' : ['A', 'B', 'C'] * 4,
   .....:                    'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
   .....:                    'D' : np.random.randn(12),
   .....:                    'E' : np.random.randn(12)})

In [87]:
df

        A  B    C         D         E
0     one  A  foo  0.227056 -0.870417
1     one  B  foo -0.918687  1.378698
2     two  C  foo  0.649731  1.063249
3   three  A  bar  0.098949 -0.629399
4     one  B  bar -0.067211  0.910388
5     one  C  bar  0.319610  0.226985
6     two  A  foo  0.431834  0.941042
7   three  B  foo -0.791118 -0.040060
8     one  C  foo -0.726031 -1.077120
9     one  A  bar  0.412199  0.514996
10    two  B  bar  0.589890  0.572687
11  three  C  bar -1.006559 -1.025003

We can produce pivot tables from this data very easily:

In [88]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  0.412199  0.227056
      B -0.067211 -0.918687
      C  0.319610 -0.726031
three A  0.098949       NaN
      B       NaN -0.791118
      C -1.006559       NaN
two   A       NaN  0.431834
      B  0.589890       NaN
      C       NaN  0.649731

### Time Series

pandas has simple, powerful, and efficient functionality for performing resampling operations during frequency conversion (e.g., converting secondly data into 5-minutely data). This is extremely common in, but not limited to, financial applications. See the [Time Series section](https://pandas.pydata.org/pandas-docs/stable/timeseries.html#timeseries)

In [89]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts.resample('5Min').sum()

2012-01-01    24825
Freq: 5T, dtype: int64

Time zone representation

In [91]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')
ts = pd.Series(np.random.randn(len(rng)), rng)
ts

2012-03-06    0.602317
2012-03-07    0.086503
2012-03-08   -0.821026
2012-03-09   -0.984422
2012-03-10    0.963755
Freq: D, dtype: float64

In [93]:
ts_utc = ts.tz_localize('UTC')
ts_utc

2012-03-06 00:00:00+00:00    0.602317
2012-03-07 00:00:00+00:00    0.086503
2012-03-08 00:00:00+00:00   -0.821026
2012-03-09 00:00:00+00:00   -0.984422
2012-03-10 00:00:00+00:00    0.963755
Freq: D, dtype: float64

Convert to another time zone

In [94]:
ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00    0.602317
2012-03-06 19:00:00-05:00    0.086503
2012-03-07 19:00:00-05:00   -0.821026
2012-03-08 19:00:00-05:00   -0.984422
2012-03-09 19:00:00-05:00    0.963755
Freq: D, dtype: float64

Converting between time span representations

In [96]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2012-01-31    0.243646
2012-02-29   -0.002826
2012-03-31    0.611073
2012-04-30   -0.520338
2012-05-31   -0.356647
Freq: M, dtype: float64

In [97]:
ps = ts.to_period()
ps

2012-01    0.243646
2012-02   -0.002826
2012-03    0.611073
2012-04   -0.520338
2012-05   -0.356647
Freq: M, dtype: float64

In [98]:
ps.to_timestamp()

2012-01-01    0.243646
2012-02-01   -0.002826
2012-03-01    0.611073
2012-04-01   -0.520338
2012-05-01   -0.356647
Freq: MS, dtype: float64

Converting between period and timestamp enables some convenient arithmetic functions to be used. In the following example, we convert a quarterly frequency with year ending in November to 9am of the end of the month following the quarter end:

In [99]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')
ts = pd.Series(np.random.randn(len(prng)), prng)
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9
ts.head()

1990-03-01 09:00    0.833709
1990-06-01 09:00    0.673008
1990-09-01 09:00   -1.966012
1990-12-01 09:00    1.998823
1991-03-01 09:00   -0.152389
Freq: H, dtype: float64

### Categoricals

Since version 0.15, pandas can include categorical data in a DataFrame. For full docs, see the [categorical introduction](https://pandas.pydata.org/pandas-docs/stable/categorical.html#categorical) and the [API documentation](https://pandas.pydata.org/pandas-docs/stable/api.html#api-categorical).

In [100]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})

Convert the raw grades to a categorical data type.

In [101]:
df["grade"] = df["raw_grade"].astype("category")
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

Rename the categories to more meaningful names (assigning to Series.cat.categories is inplace!)

In [102]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

Reorder the categories and simultaneously add the missing categories (methods under Series .cat return a new Series per default).

In [104]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): [very bad, bad, medium, good, very good]

Sorting is per order in the categories, not lexical order.

In [105]:
df.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

Grouping by a categorical column shows also empty categories.

In [106]:
df.groupby("grade").size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64

### Plotting

[Plotting](https://pandas.pydata.org/pandas-docs/stable/visualization.html#visualization) docs.

In [108]:
ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000', periods=1000))
ts = ts.cumsum()
ts.plot()

On DataFrame, [plot()](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.plot.html#pandas.DataFrame.plot) is a convenience to plot all of the columns with labels:

In [123]:
df = pd.DataFrame(np.random.randn(1000, 4), index=ts.index,columns=['A', 'B', 'C', 'D'])

df = df.cumsum()
plt.figure(); df.plot(); plt.legend(loc='best')

### Getting Data In/Out
#### CSV

[Writing to a csv file](https://pandas.pydata.org/pandas-docs/stable/io.html#io-store-in-csv)

In [124]:
df.to_csv('foo.csv')

[Reading from a csv file](https://pandas.pydata.org/pandas-docs/stable/io.html#io-read-csv-table)

In [125]:
pd.read_csv('foo.csv')

     Unnamed: 0          A          B          C          D
0    2000-01-01  -0.910556  -1.545417   0.188507   0.559820
1    2000-01-02   0.373343  -0.116611  -0.185180  -0.225997
2    2000-01-03  -0.142275   0.704828   0.471386   0.633212
3    2000-01-04   0.934022   0.731737   1.786989  -0.729610
4    2000-01-05   0.358642   0.221065   2.684632  -1.454626
5    2000-01-06  -1.308366   1.179378   0.140013  -2.488766
6    2000-01-07  -0.454445   0.729565   0.361280  -4.787469
7    2000-01-08  -1.098486   0.261791   0.381493  -4.200625
8    2000-01-09  -2.157339   0.883578   2.512046  -5.008484
9    2000-01-10  -3.263733   1.160326   3.960256  -4.171166
10   2000-01-11  -4.281906   1.407885   4.391472  -3.250233
11   2000-01-12  -3.940570   3.236058   4.160873  -3.410567
12   2000-01-13  -4.913182   2.582463   6.739778  -3.366437
13   2000-01-14  -4.934900   2.669572   6.848885  -4.013863
14   2000-01-15  -4.221736   2.364220   5.599559  -6.629536
15   2000-01-16  -5.742352   0.143775   6.834178  -7.413304
16   2000-01-17  -6.762771   0.639225   7.208280  -8.609705
17   2000-01-18  -7.320030   1.207606   6.926003  -8.300989
18   2000-01-19  -6.097432   3.107728   5.702137  -7.639190
19   2000-01-20  -5.801029   2.964945   6.597975  -8.142174
20   2000-01-21  -5.216726   4.073866   6.754302  -9.233708
21   2000-01-22  -5.922498   4.425095   6.054931  -7.782695
22   2000-01-23  -5.570809   4.267051   8.069022  -8.852631
23   2000-01-24  -6.477808   4.570579   8.003049  -9.202786
24   2000-01-25  -7.082641   5.056767   6.608375  -9.010367
25   2000-01-26  -7.193565   5.213726   6.264012  -9.516583
26   2000-01-27  -8.128036   6.720282   6.954781  -8.726711
27   2000-01-28  -7.867742   6.658053   7.103612  -7.120272
28   2000-01-29  -7.599814   6.523884   7.998524  -8.226622
29   2000-01-30  -6.600415   7.697928   7.264413  -8.093527
..          ...        ...        ...        ...        ...
970  2002-08-28   1.120860  18.147286  20.741799 -40.589727
971  2002-08-29   1.953623  18.437565  20.392574 -40.399090
972  2002-08-30   1.444187  17.817685  19.809800 -40.092326
973  2002-08-31   0.572704  15.302224  18.748191 -40.025375
974  2002-09-01  -0.010476  15.467755  18.087457 -40.928968
975  2002-09-02   0.526808  15.795849  18.148194 -38.407749
976  2002-09-03   1.797870  16.783807  18.533031 -37.316300
977  2002-09-04   1.196706  18.239676  17.876219 -38.265966
978  2002-09-05   1.608956  16.785447  16.930586 -37.569312
979  2002-09-06   1.800609  15.510798  14.626188 -36.161501
980  2002-09-07   3.183535  14.626194  15.342846 -36.262504
981  2002-09-08   5.054452  14.722055  16.137563 -36.306604
982  2002-09-09   5.404154  15.476746  18.511264 -35.538736
983  2002-09-10   7.072559  14.667781  19.069192 -34.969460
984  2002-09-11   7.783478  16.362803  18.806444 -35.587558
985  2002-09-12   8.866035  15.818117  19.328770 -33.651882
986  2002-09-13  10.600745  14.506352  19.661962 -35.056466
987  2002-09-14  10.442868  15.742588  18.437957 -34.165857
988  2002-09-15  10.038415  16.746048  17.666293 -34.464068
989  2002-09-16   9.330489  15.616907  18.422307 -33.326217
990  2002-09-17   8.900009  14.969833  19.857261 -33.705564
991  2002-09-18  10.108561  15.219565  19.725759 -33.171343
992  2002-09-19  10.457609  13.329819  21.072764 -34.714137
993  2002-09-20  11.762031  13.988547  20.869271 -33.028222
994  2002-09-21  12.234344  12.990583  21.416444 -31.913443
995  2002-09-22  12.025271  13.406129  22.635219 -30.408787
996  2002-09-23  12.941569  12.658039  21.241339 -29.990762
997  2002-09-24  14.435235  13.305746  20.156422 -28.880799
998  2002-09-25  13.982616  11.591515  21.266888 -30.238048
999  2002-09-26  11.693571  11.375584  20.578080 -31.431854

[1000 rows x 5 columns]

### HDF5

Reading and writing to [HDFStores](https://pandas.pydata.org/pandas-docs/stable/io.html#io-hdf5)

Writing to a HDF5 Store

In [119]:
df.to_hdf('foo.h5','df')

ImportError: HDFStore requires PyTables, "No module named tables" problem importing

Reading from a HDF5 Store

In [115]:
pd.read_hdf('foo.h5','df')

IOError: File foo.h5 does not exist

### Excel

Reading and writing to [MS Excel](https://pandas.pydata.org/pandas-docs/stable/io.html#io-excel)

Writing to an excel file

In [116]:
df.to_excel('foo.xlsx', sheet_name='Sheet1')

ImportError: No module named openpyxl

Reading from an excel file

In [117]:
pd.read_excel('foo.xlsx', 'Sheet1', index_col=None, na_values=['NA'])

ImportError: No module named xlrd

### Gotchas

If you are trying an operation and you see an exception like:
```
>>> if pd.Series([False, True, False]):
    print("I was true")
Traceback
    ...
ValueError: The truth value of an array is ambiguous. Use a.empty, a.any() or a.all().
```
See [Comparisons](https://pandas.pydata.org/pandas-docs/stable/basics.html#basics-compare) for an explanation and what to do.

See [Gotchas](https://pandas.pydata.org/pandas-docs/stable/gotchas.html#gotchas) as well.

# Finally
KP: Here I am just trying to find out if the [scikit-learn](http://scikit-learn.org/stable/) and [ROOT](https://github.com/root-project/root/tree/master/bindings/pyroot/JupyROOT) modules is recognized and no error is thrown. I plan to try it in more detail later in another notebook.
## scikit-learn
Machine Learning in Python
* Simple and efficient tools for data mining and data analysis
* Accessible to everybody, and reusable in various contexts
* Built on NumPy, SciPy, and matplotlib
* Open source, commercially usable - BSD license

In [5]:
import sklearn

In [4]:
import ROOT

Welcome to JupyROOT 6.10/04

In [8]:
import pandas_datareader as pdr
pdr.get_data_yahoo('AAPL')

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2010-01-04,30.490000,30.642857,30.340000,30.572857,27.613066,123432400
2010-01-05,30.657143,30.798571,30.464285,30.625713,27.660807,150476200
2010-01-06,30.625713,30.747143,30.107143,30.138571,27.220825,138040000
2010-01-07,30.250000,30.285715,29.864286,30.082857,27.170504,119282800
2010-01-08,30.042856,30.285715,29.865715,30.282858,27.351143,111902700
2010-01-11,30.400000,30.428572,29.778572,30.015715,27.109863,115557400
2010-01-12,29.884285,29.967142,29.488571,29.674286,26.801487,148614900
2010-01-13,29.695715,30.132856,29.157143,30.092857,27.179537,151473000
2010-01-14,30.015715,30.065714,29.860001,29.918571,27.022121,108223500
2010-01-15,30.132856,30.228571,29.410000,29.418571,26.570528,148516900
2010-01-19,29.761429,30.741428,29.605715,30.719999,27.745962,182501900
2010-01-20,30.701429,30.792856,29.928572,30.247143,27.318890,153038200
2010-01-21,30.297142,30.472857,29.601429,29.724285,26.846643,152038600
2010-01-22,29.540001,29.642857,28.165714,28.250000,25.515087,220441900
2010-01-25,28.930000,29.242857,28.598572,29.010000,26.201517,266424900
2010-01-26,29.421429,30.530001,28.940001,29.420000,26.571819,466777500
2010-01-27,29.549999,30.082857,28.504286,29.697144,26.822136,430642100
2010-01-28,29.275715,29.357143,28.385714,28.469999,25.713791,293375600
2010-01-29,28.725714,28.885714,27.178572,27.437143,24.780926,311488100
2010-02-01,27.481428,28.000000,27.328571,27.818571,25.125425,187469100
2010-02-02,27.987143,28.045713,27.625713,27.980000,25.271231,174585600
2010-02-03,27.881428,28.600000,27.774286,28.461428,25.706045,153832000
2010-02-04,28.104286,28.338572,27.367144,27.435715,24.779634,189413000
2010-02-05,27.518572,28.000000,27.264286,27.922857,25.219614,212576700
2010-02-08,27.955715,28.268572,27.714285,27.731428,25.046721,119567700
2010-02-09,28.059999,28.214285,27.821428,28.027143,25.313808,158221700
2010-02-10,27.984285,28.085714,27.751429,27.874287,25.175749,92590400
2010-02-11,27.840000,28.535715,27.722857,28.381428,25.633789,137586400
2010-02-12,28.301428,28.805714,27.928572,28.625713,25.854427,163867200
2010-02-16,28.848572,29.098572,28.788572,29.057142,26.244091,135934400
...,...,...,...,...,...,...
2017-06-20,146.869995,146.869995,144.940002,145.009995,145.009995,24900100
2017-06-21,145.520004,146.070007,144.610001,145.869995,145.869995,21265800
2017-06-22,145.770004,146.699997,145.119995,145.630005,145.630005,19106300
2017-06-23,145.130005,147.160004,145.110001,146.279999,146.279999,35439400
2017-06-26,147.169998,148.279999,145.380005,145.820007,145.820007,25692400
2017-06-27,145.009995,146.160004,143.619995,143.729996,143.729996,24761900
2017-06-28,144.490005,146.110001,143.160004,145.830002,145.830002,22082400
2017-06-29,144.710007,145.130005,142.279999,143.679993,143.679993,31499400
2017-06-30,144.449997,144.960007,143.779999,144.020004,144.020004,23024100
2017-07-03,144.880005,145.300003,143.100006,143.500000,143.500000,14258300
2017-07-05,143.690002,144.789993,142.720001,144.089996,144.089996,21569600
2017-07-06,143.020004,143.500000,142.410004,142.729996,142.729996,24128800
2017-07-07,142.899994,144.750000,142.899994,144.179993,144.179993,19201700
2017-07-10,144.110001,145.949997,143.369995,145.059998,145.059998,21090600
2017-07-11,144.729996,145.850006,144.380005,145.529999,145.529999,19781800
2017-07-12,145.869995,146.179993,144.820007,145.740005,145.740005,24884500
2017-07-13,145.500000,148.490005,145.440002,147.770004,147.770004,25199400
2017-07-14,147.970001,149.330002,147.330002,149.039993,149.039993,20132100
2017-07-17,148.820007,150.899994,148.570007,149.559998,149.559998,23793500
2017-07-18,149.199997,150.130005,148.669998,150.080002,150.080002,17868800
2017-07-19,150.479996,151.419998,149.949997,151.020004,151.020004,20923000
2017-07-20,151.500000,151.740005,150.190002,150.339996,150.339996,17243700
2017-07-21,149.990005,150.440002,148.880005,150.270004,150.270004,26252600
2017-07-24,150.580002,152.440002,149.899994,152.089996,152.089996,21493200
2017-07-25,151.800003,153.839996,151.800003,152.740005,152.740005,18853900
2017-07-26,153.350006,153.929993,153.059998,153.460007,153.460007,15781000
2017-07-27,153.750000,153.990005,147.300003,150.559998,150.559998,32476300
2017-07-28,149.889999,150.229996,149.190002,149.500000,149.500000,17213700
2017-07-31,149.899994,150.330002,148.130005,148.729996,148.729996,19614200
2017-08-01,149.100006,150.220001,148.410004,150.050003,150.050003,23716478